#+NAME: shrek
#+begin_text
;; ⢀⡴⠑⡄⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
;; ⠸⡇⠀⠿⡀⠀⠀⠀⣀⡴⢿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀
;; ⠀⠀⠀⠀⠑⢄⣠⠾⠁⣀⣄⡈⠙⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀
;; ⠀⠀⠀⠀⢀⡀⠁⠀⠀⠈⠙⠛⠂⠈⣿⣿⣿⣿⣿⠿⡿⢿⣆⠀⠀⠀⠀⠀⠀⠀
;; ⠀⠀⠀⢀⡾⣁⣀⠀⠴⠂⠙⣗⡀⠀⢻⣿⣿⠭⢤⣴⣦⣤⣹⠀⠀⠀⢀⢴⣶⣆
;; ⠀⠀⢀⣾⣿⣿⣿⣷⣮⣽⣾⣿⣥⣴⣿⣿⡿⢂⠔⢚⡿⢿⣿⣦⣴⣾⠁⠸⣼⡿
;; ⠀⢀⡞⠁⠙⠻⠿⠟⠉⠀⠛⢹⣿⣿⣿⣿⣿⣌⢤⣼⣿⣾⣿⡟⠉⠀⠀⠀⠀⠀
;; ⠀⣾⣷⣶⠇⠀⠀⣤⣄⣀⡀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀
;; ⠀⠉⠈⠉⠀⠀⢦⡈⢻⣿⣿⣿⣶⣶⣶⣶⣤⣽⡹⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀
;; ⠀⠀⠀⠀⠀⠀⠀⠉⠲⣽⡻⢿⣿⣿⣿⣿⣿⣿⣷⣜⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀
;; ⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣷⣶⣮⣭⣽⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀
;; ⠀⠀⠀⠀⠀⠀⣀⣀⣈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀
;; ⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀
;; ⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀
;; ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⠿⠿⠿⠿⠛⠉
#+end_text

#+NAME: ankylosaur
#+begin_text
;;                              /~~~~~~~~~~~~\_
;;          _+=+_             _[~  /~~~~~~~~~~~~\_
;;         {""|""}         [~~~    [~   /~~~~~~~~~\_
;;          """:-'~[~[~"~[~  ((++     [~  _/~~~~~~~~\_
;;               '=_   [    ,==, ((++    [    /~~~~~~~\-~~~-.
;;                  ~-_ _=+-(   )/   ((++  .~~~.[~~~~(  {@} \`.
;;                          /   }\ /     (     }     (   .   ''}
;;                         (  .+   \ /  //     )    / .,  """"/
;;                         \\  \     \ (   .+~~\_  /.= /'""""
;;        -r.millward-     <"_V_">      \\  \    ~~~~~~\\  \
;;                                       \\  \          \\  \
;;                                       <"_V_">        <"_V_">
;; Ankylosaur
;;
;;
;;              " Clankity, clankity, clankity clank!
;;                Ankylosaurus was built like a tank.
;;                Its hide was a fortress sturdy as steel,
;;                It tended to be an inedible meal. "
;;                                       -- Jack Prelutsky
#+end_text

#+NAME: plesiosaur
#+begin_text
;;                         _..--+~/@-~--.
;;                     _-=~      (  .   "}
;;                  _-~     _.--=.\ \""""
;;                _~      _-       \ \_\
;;               =      _=          '--'
;;              '      =                             .
;;             :      :       ____                   '=_. ___
;;        ___  |      ;                            ____ '~--.~.
;;             ;      ;                               _____  } |
;;          ___=       \ ___ __     __..-...__           ___/__/__
;;             :        =_     _.-~~          ~~--.__
;;        _____ \         ~-+-~                   ___~=_______
;;             ~@#~~ == ...______ __ ___ _--~~--_
;; Plesiosaur                                          -r.millward-
;;
;;
;;            " Swish! Swish! Swish! Swish!
;;              Plesiosaurus swam over the ocean,
;;              It caused a commotion wherever it went,
;;              A reptile cretaceous,
;;              Its habits voracious,
;;              It never paid income tax, phone bills or rent."
;;                                  -- Jack Prelutsky
#+end_text

#+NAME: corythosaur
#+begin_text
;;                                         .--.
;;                                        {(^^)}
;;                       __..._         _.''''a`._
;;                   _.-'      '~-._.-~~     (  .__}
;;                _-~                       _.`--j|
;;             _-~     _         /^\    _.-~     &|
;;          _-~     ,-~ ~-.      \\ ) .~
;;        .'       {       )      \\|'
;;      .'         {       /  _.-' |:
;;    .'            \     /.-'     \\
;;  .'        __.-~.=\   /          `}
;; ;      _.-~   / ./ |  }
;; {    _.'     / /   | /
;; {    =      {=+__  | :
;;  :   :_      `-- = \,_`-.
;;   `.   '=_                     -r.millward-
;;      '-.___'_::='
;;
;; Corythosaur
;;
;;
;;            " Corythosaurus, long ago,
;;              Wandered to and wandered fro,
;;              Ambled in and ambled out,
;;              Munching as it went about.
;;
;;              Corythosaurus, moved with grace,
;;              It had a duck-bill on its face,
;;              It had a helmet on its head,
;;              Could have used some brains instead. "
;;                                         -- Jack Prelutsky
#+end_text

#+NAME: stegosaurus
#+begin_text
;;                          .       .
;;                         / `.   .' \
;;                 .---.  <    > <    >  .---.
;;                 |    \  \ - ~ ~ - /  /    |
;;                  ~-..-~             ~-..-~
;;              \~~~\.'                    `./~~~/
;;               \__/                        \__/
;;                /                  .-    .  \
;;         _._ _.-    .-~ ~-.       /       }   \/~~~/
;;     _.-'q  }~     /       }     {        ;    \__/
;;    {'__,  /      (       /      {       /      `. ,~~|   .     .
;;     `''''='~~-.__(      /_      |      /- _      '..-'   \\   //
;;                 / \   =/  ~~--~~{    ./|    ~-.     '-..__\\_//_.-'
;;                {   \  +\         \  =\ (        ~ - . _ _ _..---~
;;                |  | {   }         \   \_\
;;               '---.o___,'       .o___,'       -r.millward-
;;
;; Stegosaurus
;;
;;            " Stegosaurus was a creature uncontentious and benign,
;;              And the row of armoured plates upon its back
;;              Failed to guard its tender belly
;;              Or protect its flimsy spine:
;;              Stegosaurus often wound up as a snack,
;;              Stegosaurus often wound up as a snack. "
;;                                        -- Jack Prelutsky
#+end_text

#+NAME: coffee
#+begin_text
;;                         (
;;                           )     (
;;                    ___...(-------)-....___
;;                .-""       )    (          ""-.
;;          .-'``'|-._             )         _.-|
;;         /  .--.|   `""---...........---""`   |
;;        /  /    |                             |
;;       |  |    |                             |
;;         \  \   |                             |
;;          `\ `\ |                             |
;;            `\ `|                             |
;;            _/ /\                             /
;;           (__/  \                           /
;;        _..---""` \                         /`""---.._
;;     .-'           \                       /          '-.
;;    :               `-.__             __.-'              :
;;    :                  ) ""---...---"" (                 :
;;     '._               `"--...___...--"`              _.'
;;       \""--..__                              __..--""/
;;        '._     """----.....______.....----"""     _.'
;;           `""--..,,_____            _____,,..--""`
;;                         `"""----"""`
#+end_text

#+NAME: gaetan-juvin
#+begin_text
;; ............... .                             ............,
;; .............                    ,(##(/,         .........,
;; ...........                   .#.,%#%%##((((       .......,
;; .........                    * G/%%%%%%%%%###(     ........
;; .......                    #%%%#%%%%%%%%&%%%%%#      ......
;; .....            &&%###(((%%%%%%%%%%%%%%%%%%%%%#.     ...,.
;; ....             %@@@@#%#%%%%%&%%%%%%&&%%%%%%%%%#     ...,.
;; ...                     (%%%%%%%%%@%%%%%%%%%%%%&&     ...,,
;; ..                      .*/((#%&&&&&&@&&%%%%%%%%&     .,,,.
;; ..                       *//((//(////#&@@@@%%%&&%     .,,,,
;;                          ,/**////****(%&&%%#/&&%.     .,,,,
;;                        .***,,,*,,,***/##(##/##&@..    .,,,,
;;                        *((/(,,,*****/##(#//(&@@&*,    .,,,,
;;                          ,**,,,******//(/*((&@@%&*.,  .,,,,
;;                          ,*/(*******//((((((%@&%/%/.  .,,*,
;;                       *#(#***/**////(((((((((((#%/#((/****,
;;                  .*((##&/***/((###(((((((((((/*/(%##%#####/
;;               ./((#%##%&%&&&%%%%(%(#((((((((((/(######%##((
;;              /(##%#&%%%&%&&&&%%#%(####(((/(((#(###%##%##%#(
;;            *(###%%##&%%&&&&%&%%%######(((((##/%%%###%%##%##
;;           /(##%#%&%%%&%&%%&%%%%%%%%##(((((((%%%%%#%%%%%%%##
;; ..       /(##%#%%&%%&%%@%&&%%%&%&%%%%#(((/%%%&%#%%%%%%#%%#%
;; .....   .##%#%%%%%%%&&&&&%&&%%&%%&%%%%%#%%%&%%%%%#%#%%%%%%%
;; ....... (##%#%%%%@%%&&&&&&&&&%%&%&%&&%&%%%%%%%%%%%#%%%&&&&%
;; ........((#%%#%#&&&%&%&%%%%%&&&%%%%&&&%%%##%%%%%%%%%%%@&&%&
;; ....../##(####&&%%&&&&&&&%&&%&&&%%%&&&&%%%#%%%%%%%%%%&@&&&%
;; .....,#%%##%%%%%&&&&&&&&%%%%%&&&&&%&&&&&&%%%%%%%&%%%%&@&&&%
;; ....#%&&%&&&&%%%&@&&&&&%%%%%&&&&@&&&&&&&&&%%%%%&%%%%&&@@@&%
;; ...#(######%%&&@&@@&&&&&&&%&&&&@&&&&&&&&&&&%%%&%%%&&&@@@@&%
#+end_text

#+NAME: keanu-breathtaking
#+begin_text
;; ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣤⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
;; ⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣀⠀⠀⠀⠀⠀
;; ⠀⠀⠀⠀⣰⣿⣿⣿⣿⠿⠿⣿⣿⣿⣿⣿⣿⣿⣧⢀⠀⠀⠀⠀
;; ⠀⠀⠀⣿⣿⣿⠋⠀⠀⠀⠀⠀⠙⠀⠙⣿⣿⣿⣷⢳⢀⠀⠀⠀
;; ⠀⠀⣠⣿⣿⣿⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⢀
;; ⠀⠀⣸⣿⣿⣿⠸⠀⠀⠀⠒⠒⠒⠐⠀⠀⢿⣿⣿⣿⣿⣿⠀⠀
;; ⠀⣴⣿⣿⣿⡿⠀⠒⣋⣙⡒⢰⠀⠤⣖⠒⢾⣿⣿⣿⣿⣧⠀⠀
;; ⢺⣿⣿⣿⣿⢀⠀⠀⠉⠉⠉⠸⠀⡇⠉⠉⠀⢿⣿⣿⣿⣄⠀⠀
;; ⠀⠙⣿⣿⣧⢻⠀⠀⠀⠀⠀⠠⠀⠰⠀⠀⠀⣸⠸⣿⣿⠿⠰⠀
;; ⠀⠀⠀⠹⣿⣿⣿⣷⠀⡠⠙⣲⣔⣅⢡⣰⣷⣿⣿⣿⣧⠀⠀⠀
;; ⠀⠀⠀⣼⣿⣿⣿⣿⠀⡿⠭⠭⠭⠭⢿⠀⣿⢻⣿⣿⠃⠀⠀⠀
;; ⠀⠀⠀⠙⠛⣿⢻⠹⣿⠐⠙⠛⠟⠉⢀⣴⡟⢿⣿⡏⠀⠀⠀⠀
;; ⠀⠀⠀⠀⠀⠀⡟⠀⠀⠻⣦⣤⣶⠾⠋⠀⠀⠁⡦⢄⢀⠀⠀⠀
;; ⠀⠀⠀⠀⡠⠁⡇⠑⢄⠀⠀⠀⠀⠀⠀⠔⠀⠀⠁⠀⠀⠀⠉⠁
;; ⠀⠔⠊⠁⠀⠀⣇⠀⠀⠀⠑⡤⠤⢎⠁⠀⠀⡘⠀⠀⠀⠀⠀⠀
;; ⠀⠀⠀⠀⠀⠀⢢⠠⠀⡠⢆⠀⠀⡠⠙⢄⠀⡸⠀⠀⠀⠀⠀⠀ You're breathtaking
#+end_text

#+NAME: pale-blue-dot
#+begin_text
;;                                                        ..       :
;;                     .                  .               .   .  .
;;       .           .                .               .. .  .  *
;;              *          .                    ..        .
;;                            .             .     . :  .   .    .  .
;;             .                         .   .  .  .   .
;;                                          . .  *:. . .
;; .                                 .  .   . .. .         .
;;                          .     . .  . ...    .    .
;;        .              .  .  . .    . .  . .
;;                         .    .     . ...   ..   .       .               .
;;                  .  .    . *.   . .
;;     .                   :.  .           .
;;                  .   .    .    .
;;              .  .  .    ./|\
;;             .  .. :.    . |             .               .
;;      .   ... .            |
;;  .    :.  . .   *.        |     .               .
;;    .  *.             You are here.
;;  . .    .               .             *.                         .
#+end_text

#+NAME: dragon
#+begin_text
;;                                             .~))>>             ___
;;                                           .~))>>)))>>      .-~))>>
;;                                         .~)))))>>       .-~))>>)>
;;                                       .~)))>>))))>>  .-~)>>)>
;;                   )                 .~))>>))))>>  .-~)))))>>)>
;;                ( )@@*)             //)>))))))  .-~))))>>)>
;;              ).@(@@               //))>>))) .-~))>>)))))>>)>
;;            (( @.@).              //))))) .-~)>>)))))>>)>
;;          ))  )@@*.@@ )          //)>))) //))))))>>))))>>)>
;;       ((  ((@@@.@@             |/))))) //)))))>>)))>>)>
;;      )) @@*. )@@ )   (\_(\-\b  |))>)) //)))>>)))))))>>)>
;;    (( @@@(.@(@ .    _/`-`  ~|b |>))) //)>>)))))))>>)>
;;     )* @@@ )@*     (@) (@)  /\b|))) //))))))>>))))>>
;;   (( @. )@( @ .   _/       /  \b)) //))>>)))))>>>_._
;;    )@@ (@@*)@@.  (6,   6) / ^  \b)//))))))>>)))>>   ~~-.
;; ( @jgs@@. @@@.*@_ ~^~^~, /\  ^  \b/)>>))))>>      _.     `,
;;  ((@@ @@@*.(@@ .   \^^^/' (  ^   \b)))>>        .'         `,
;;   ((@@).*@@ )@ )    `-'   ((   ^  ~)_          /             `,
;;     (@@. (@@ ).           (((   ^    `\        |               `.
;;       (*.@*              / ((((        \        \      .         `.
;;                         /   (((((  \    \    _.-~\     Y,         ;
;;                        /   / (((((( \    \.-~   _.`" _.-~`,       ;
;;                       /   /   `(((((()    )    (((((~      `,     ;
;;                     _/  _/      `"""/   /'                  ;     ;
;;                 _.-~_.-~           /  /'                _.-~   _.'
;;               ((((~~              / /'              _.-~ __.--~
;;                                  ((((          __.-~ _.-~
;;                                              .'   .~~
;;                                              :    ,'
;;                                              ~~~~~
#+end_text

#+NAME: pooh-bear
#+begin_text
;;                  .--,
;;   .-.    __,,,__/    |
;;  /   \-'`        `-./_
;; |    |               `)
;;   \   `             `\ ;
;;  /       ,        ,    |
;; |      /         : O /_       Oh bother...
;; |          O  .--;__   '.   Time to write more bugs than swarm the
;; |                (  )`.  |  Hundred Acre Wood on a hot summer day
;;  \                 `-` /  |
;;   \          ,_  _.-./`  /
;;    \          \``-.(    /
;;   |           '---'   /--.
;;  ,--\___..__        _.'   /--.
;;  \          `-._  _`/    '    '.
;;  .' ` ' .       ``    '        .
#+end_text

#+NAME: tux
#+begin_text
;;                _nnnn_
;;               dGGGGMMb
;;              @p~qp~~qMb
;;              M|@||@) M|
;;              @,----.JM|
;;             JS^\__/  qKL
;;            dZP        qKRb
;;           dZP          qKKb
;;          fZP            SMMb
;;          HZM            MMMM
;;          FqM            MMMM
;;        __| ".        |\dS"qML
;;        |    `.       | `' \Zq
;;       _)      \.___.,|     .'
;;       \____   )MMMMMP|   .'
;;            `-'       '--'
#+end_text

#+NAME: bulbasaur
#+begin_text
;;                                                  /
;;                               _,.------....___,.’ ’,.-.
;;                            ,-’          _,.--"        |
;;                          ,’         _.-’              .
;;                         /   ,     ,’                   ‘
;;                        .   /     /                     ‘‘.
;;                        |  |     .                       \.\
;;              ____      |___._.  |       __               \ ‘.
;;            .’    ‘---""       ‘‘"-.--"’‘  \               .  \
;;           .  ,            __               ‘              |   .
;;           ‘,’         ,-"’  .               \             |    L
;;          ,’          ’    _.’                -._          /    |
;;         ,‘-.    ,".   ’--’                      >.      ,’     |
;;        . .’\’   ‘-’       __    ,  ,-.         /  ‘.__.-      ,’
;;        ||:, .           ,’  ;  /  / \ ‘        ‘.    .      .’/
;;        ||:   \          ’--’  ’ ,’_  . .         ‘.__, \   , /
;;       / \:_  |                 .  "’ :_;                ‘.’.’
;;       .    ""’                  """""’                    V
;;        ‘.                                 .    ‘.   _,..  ‘
;;          ‘,_   .    .                _,-’/    .. ‘,’   __  ‘
;;           ) \‘._        ___....----"’  ,’   .’  \ |   ’  \  .
;;          /   ‘. "‘-.--"’         _,’ ,’     ’---’ |    ‘./  |
;;         .   _  ‘""’--.._____..--"   ,             ’         |
;;         | ." ‘. ‘-.                /-.           /          ,
;;         | ’._.’    ‘,_            ;  /         ,’          .
;;        .’          /| ‘-.        . ,’         ,           ,
;;        ’-.__ __ _,’,’    ’‘-..___;-...__   ,.’\ ____.___.’
;;        ‘"^--’..’   ’-’-^-’"--    ’-^-’‘.’’"""""‘.,^.’.--’
#+end_text

#+NAME: squirtle
#+begin_text
;;                _,........__
;;             ,-’            "‘-.
;;           ,’                   ‘-.
;;         ,’                        \
;;       ,’                           .
;;       .’\               ,"".       ‘
;;      ._.’|             / |  ‘       \
;;     |   |            '-.’  ||       ‘.
;;     |   |            ’-._,’||       | \
;;      .‘.,’             ‘..,’.’       , |‘-.
;;      l                       .’‘.  _/  |   ‘.
;;      '-.._’-   ,          _ _’   -" \  .     ‘
;; ‘."""""’-.‘-...,---------’,’         ‘. ‘....__.
;; .’        ‘"-..___      __,’\          \  \     \
;; \_ .          |   ‘""""’    ‘.           . \     \
;;   ‘.          |              ‘.          |  .     L
;;     ‘.        |'--...________.’.        j   |     |
;;       ‘._    .’      |          ‘.     .|   ,     |
;;          ‘--,\       .            ‘7""’ |  ,      |
;;             ‘ ‘      ‘            /     |  |      |    _,-’"""‘-.
;;              \ ‘.     .          /      |  ’      |  ,’          ‘.
;;               \  v.__  .        ’       .   \    /| /              \
;;                \/    ‘""\"""""""‘.       \   \  /.’’                |
;;                 ‘        .        ‘._ ___,j.  ‘/ .-       ,---.     |
;;                 ,‘-.      \         ."     ‘.  |/        j     ‘    |
;;                /    ‘.     \       /         \ /         |     /    j
;;              |       ‘-.   7-.._ .          |"          ’         /
;;              |          ‘./_    ‘|          |            .     _,’
;;               ‘.           / ‘----|          |-............'---’
;;                 \          \      |          |
;;                ,’           )     ‘.         |
#+end_text

#+NAME: charmander
#+begin_text
;;           ,’          __  ‘.
;;          /|          " __   \
;;         , |           / |.   .
;;        |,’          !_.’|   |
;;       ,’             ’   |   |
;;      /              |'--’|   |
;;    |                '---’   |
;;      .   ,                   |                       ,".
;;       ._     ’           _’  |                    , ’ \ ‘
;;   ‘.. ‘.‘-...___,...---""    |       __,.        ,‘"   L,|
;;  |, ‘- .‘._        _,-,.’   .  __.-’-. /        .   ,    \
;; -:..     ‘. ‘-..--_.,.<       ‘"      / ‘.        ‘-/ |   .
;;   ‘,         """"’     ‘.              ,’         |   |  ’,,
;;     ‘.      ’            ’            /          ’    |’. |/
;;       ‘.   |              \       _,-’           |       ’’
;;         '._’               \   ’"\                .      |
;;           |                ’     \                ‘._  ,’
;;           |                 ’     \                 .’|
;;           |                 .      \                | |
;;           |                 |       L              ,’ |
;;            ‘                 |       |             /   ’
;;             \                |       |           ,’   /
;;           ,’ \               |  _.._ ,-..___,..-’    ,’
;;          /     .             .      ‘!             ,j’
;;         /       ‘.          /        .           .’/
;;        .          ‘.       /         |        _.’.’
;;         ‘.          7‘’---’          |------"’_.’
;;        _,.‘,_     _’                ,’’-----"’
;;    _,-_    ’       ‘.     .’      ,\
;;    -" /‘.         _,’     | _  _  _.|
;;     ""--’---"""""’        ‘’ ’! |! /
#+end_text

#+NAME: earth
#+begin_text
;;                       __...----...__
;;                    .-' -=;::;::`;:::`-.
;;                 .-'"; `-;:"";`-;   ,;;'`-.
;;               .''";;:     ,..   `.;;. .';;'.
;;              /  ,;;::,     '--'  ,.;: ::  .;:\
;;             ..- .; ;:,;,,.,   ,  ;;: ::;;:..;:.
;;            ;   ;    .;::,    ;:.;:::::::::;., ;
;;            |;. :      ;:;       `-;:::::-'""  |
;;            | ;,'  ,;::     ;.     `-;::  `;:::|
;;            ;`-;.   ,;:  ,;; `.  ."";,     ;;, ;
;;            '. ."".,        "".    ,;:;  '.,;::.
;;             `.                              .'
;;               `.                          .'
;;                 `-.                    .-'
;;                    ""--...______...--""
;;
;;             ______.._      _..________    _____
;; __.._.-.'""".: ::::  '-._.',;::::::.;:'--' ,..;`-.--...___
;; ;:::,.  ,;::::  ::    `-. ,.;::::... .; ,;::::::. ,;:::;.,
;; ;::::::::::::::  :::  ::. ,;:::::. ,:: .,;:::... ,;::::.,;
;;  ,.;:::::., .;::. :::: ::. ,;::: ,:::   .;:::::::., ,.;:::
;;   :::::::.., ,;:: ,;:::. ,.;":::.:::  ,.;:::::::;.,..,;:::
;; :::::.., .;:::::.,.:; ______.......___ ,.;::::::::;.., .,:
;; ____.....------"""""""""---.,;:::::::,""--......__________
;; :::::'                                     `,;;::::. ,;:::
;;      ,;:.         .:,                ,.;            ,__,;.
;;                            -.                 .-..
;;   .-..      ._.         ._.    ,;'       __   '--'
;;   '--'
#+end_text

#+NAME: dudeism
#+begin_text
;;                           `MOEeajFlx1xJ{u2ekD'
;;                       `DPoeXwmeauz7'\\/`7vlF}zv2h'
;;                   `&Ea6khEPwu\r':::::_~,,,,,:;`LzvLu'
;;                 `9wq996kEX7^';;;:::::_~,,,,,’’’’’:`i7/l'
;;               `eqKKq9$6ku=';`r??'::::_~:;;:,’’’’.---`*i/c'
;;             `mOOOKKq9$6S'^`rumeeZJ':::`juuFv'’’’.---‘‘’`//7'
;;            `kHdOOKKq9$m?'^`iwmeeZa|':`yjufFl'’’’.---‘‘‘‘’`l|'
;;          `aDDHdOOKKq9$}'^^;`iaeeS/'::_`zuuJ|'’’’.---‘‘‘‘‘‘_`||'
;;         `eRDDHdOOKKq9$z'^^;;;;;;:::::_~,~~,,’’’’.---‘‘‘‘‘‘ `||L'
;;         `RRDDHdOOKKq9$yr'^;;;;;;`|{S2l|',,,,’’’’.---‘‘‘‘‘‘  `*|'
;;        `HRRDDHdOOKKq9$k7'^;;;;;`raaoS2j|',,,’’’’.---‘‘‘‘‘‘   `||'
;;       `a&RRDDHdOOKKq9$6X*';;;;;;`2aoS2ur',,,’’’’.---‘‘‘‘‘‘   `r|*'
;;       `&&RRDDHdOOKKq9$66m7';;;;;:`*\\?:',,,,’’’’.---‘‘‘‘‘‘    `|?'
;;       `M&RRDDHdOOKKq9$6kEPoi';;;:::::_~,,,,,’’’’.---‘‘‘‘‘‘    `=|'
;;       `M&RRDDHdOOKKq9$6kEEPXmf7?';:::_~,,,,,’’’’.---‘‘‘‘‘‘    `ca'
;;       `M&RRDDHdOOKKq9$6kEEPXXmeeZaojuFzc|'",’’’’.---‘‘‘‘‘‘    `c|'
;;       `M&RRDDHdOOKKq9$6kEEPXwmeeZaaoS2jjuuFv',’’.---‘‘‘‘‘‘    `>?'
;;       `M&RRDDHdOOKKq9$6kEEPXwmeeZaliL7ujufFF}z'’.---‘‘‘‘‘‘    `|?'
;;       `X&RRDDHdOOKKq9$6kEEPXwmeeo':::_`iufFl}{x',---‘‘‘‘‘‘    `|r'
;;        `HRRDDHdOOKKq9$6kEEPXwmee}':::_~`ufFl}{xJ'.--‘‘‘‘‘‘   `||'
;;         `RRDDHdOOKKq9$6kEEPXwmeeZi':::`luuFl}{xJz'--‘‘‘‘‘‘  `*|'
;;         `PRDDHdOOKKq9$6kEEPXwmeeZaouFjyjuuFl}{xJz'--‘‘‘‘‘‘ `*||'
;;          `eDDHdOOKKq9$6kEEPXl';;`vooS2'^:"`={{xJz'--‘‘‘‘‘‘`?\|'
;;            `KHdOOKKq9$6kEEPJ';;;:`ioS{',,,,`?{xJz'--‘‘‘‘`:\\z'
;;             `PdOOKKq9$6kEEP2r';;:`}oSu',,,`ni{xJ'---‘‘-`\//'
;;               `XOKKq9$6kEEPXet7izoaoSSu7?*\1}tv'’---’`/i/'
;;                 `w6q9$6kEEPXwmeeZaaoS2jjuuFlt',’.,;`7L7'
;;                   `Oew$kEEPXwmeeZaaoS2jjuFLr':^`cv7vm'
;;                      `D9aaPXwmeeZaaoSju{vivJl{7xad'
;;                           `8OPeojFlx1xx}uSekR'
#+end_text

#+NAME: grateful-dead
#+begin_text
;;                            -:*vJzvvvlv1zxc>:-
;;                       ‘^]O#qz?*|zyoZZoy}vvi\xakur-
;;                    ,zDQNJriLumf?’-,?qNRRRW#QD2>^uQMu:
;;                 -/MQB9`\6RqHKkXUq'   `RRRRRRR8NQkr'PBNt.
;;               ’aQ#MD>`R$wwwwwwwwwD'  `7NRRRRRRRR88&r'ddBa,
;;             ’FQNRNZ`RqwwwmmmmmmmwXM'  `ORRRRRRRRRRRB9'wKKBe-
;;            ,NQRRNo;`Pwwmmmmmmmmmwwku'  `BRRRRRRRRRRRgN'mqUHB;
;;           ^QNRRgj`QPwmmmmmmmmmmmmmwg'   `gRRRRRRRRRRRgg'O969Q7
;;          ?QWRRR#’`kwwmmmmmmmmmmmmmXR'   `U&RRRRRRRRRRRRa'N6UUQF
;;         ;@WRRRNv`BwwmmmmmmmmmmmmmwK'’;   `8RRRRRRRRRRR8Q'm6UUUQL
;;        ‘QNRRRRB`UDwmmmmmmmmmmmmmwkP'`9e'  `RRRRRRRRRRRRQ'\O6UU9Q,
;;        zQRRRRRQ`qDwmmmmmmmmmmmmwE9'`ww9u' `iNRRRRRRRRRRQ'|O666U89
;;       ‘QNRRRRRQ`FgwmmmmmmmmmmwwUm'`XwmwH'  `ogRRRRRRRR8Q'j9666U6@.
;;       ;@RRRRRRBc`QwwmmmmmmmmwXKF'`Pwmmww&'  `XWRRRRRRRgd'g6U66UUQ?
;;       \@RRRRRRN`rFMXwmmmmmmwwdL'`$wmmmwwXH'  `ENRRRRR8Q'oO6U66U6#x
;;       \@RRRRRR&`x/UDwwmmmwXwH?'`Kwwmmmmmwkm'  `yN8&RRQ?'R6U666U6#J
;;       ;@8RRRRRRQ`ivkRXwwwwwH' `DwwmmmmmmwwO'   `egR&Q?'&666666U6Q*
;;       ‘QNRRRRRRN@O`maN9wwXH' `RXwwmmmmmmmmwM'   `wBO'-g6UU666U6U@-
;;        /QRRRRRRRQHZhJ`/dH9' `RwwwmmmmmmmmmwXH'  _;;,,eK6U6666UUWk
;;         ##RRRRRRQR6$R   `zRBDXXwmmmmmmmmwwwXdRv/'  PrQ666666U6qQ’
;;         ,QNRRRRRQxeK6R;    `>1Z$DRHdddDRdh27j'    ‘PvQ66666UUUQ=
;;          ;QgRRRRgBezg@@QBBBBgqu^--:M|,_7eDBBQgwv=zRjkg666UUU6QJ
;;           :QNRRRRR##Q@##QQ@Q####96‘‘  9NddKUejUDN@QWK6U66UU9Q/
;;            -KQ8RRRR&@PQMq&^      |’ ‘         ‘9m]OUU6UUU6DN:
;;              rBBRRRRNQHg#B;’     ’Q:q         rjdD666666HB{‘
;;                \NQMRRRRWgNQBP\i  "Q*Q:  ./BDgBQBRUUU66D#J-
;;                  ;6Q#8RRRR&Bqr#-  ‘     ~*Bg6U6U666KNDL‘
;;                    ‘?XBQN8RNgjav|k\?;>>X\vN9UU69R#Kv,
;;                        ,|oO#QQWq~D‘N‘F,DeQ&g#Hez;‘
;;                             ‘,;?ctFy2yfz/r:’
#+end_text

#+NAME: dancing-bear
#+begin_text
;;                    Ko:;::cldON     NNN      Kxl:::,'c0
;;                   No..lxxddl:;:ccccccccccloc;:odxO0o..c0
;;                   K, oKl.'cON0OOO0KKKKK0OdloOOc..,ONc.;kN
;;                   0:.:Oc  ,O                 Kc..:00,'O
;;                    0, ckooK   XOolX    0lk    N0OOo,.lN
;;                    Nd,..l0    NKOO0xodKKxO     Xo'.l0N
;;                      Xx;.'dX      x;,,oX      O:,dK
;;            KO0KXKooOKKo'..,;lOXKkoolloxk0NXOd:,l0
;;           Ko...,:,..',..:0Xk,'kNd.     ,xx,.:dK
;;        Ko;.,cdk0KKKk;. 'dN  k';xxc.   ,kx'.';xX
;;       K:  ;0       NKd. ;OKXNk;.,lollodc'cOl..dN
;;       K: .O          0l:,..dN X0xc::c::lkNXl..x
;;       x. '0     NOolodOk;.:0      NXXX   Nk'.cO
;;       kl''O    O:,cdd:..';:,:0         Xl,,..;clodxO0XN
;;     NXKO:.k   x':K  Xl'lX O'.:lcxNNX 0xd'.;.'dkxolcccc::coON
;;  Koc:ccccdX  k':X  K:'x   x,,c;..:;,xc... :;'O Kdccccccllc,:O
;; 0;,xKNN     O,;0  0;,k    XX  X0c ....'kOdx;.k Xx;.     'xk';K
;; 0,,ON     Xo,:0  0;'k           Kdk0c ;X  X;.,cldxdollccoxo'lN
;;  Oc::clllc;:xN  Xc.lN               XodN  x.:kkdlcc:ccccc;;dX
;;    NKOkkkOKN    x..o               N  N  0,.x      NK0kkO0N
;;                 0c.,0              kxN  O;..;K
;;                  x. :X             d;OKo'c0k':K
;;                  k:,.lN           Nc.,,;kN  k':K
;;                   NX:'O           0,  cX     k,;0
;;                   Nk',0          0;.,'.lK     O;,xN
;;                  0c.'k        XOo. 'Ok. ,xN    Xo,:dkkdoccco0
;;                 Kl.'O      NOl'.. .d Xxl..lX     KxlllldkOx,,0
;;                O; .k    NOl,. 'c;,oN   Xc..:K            Xk,,0
;;               Nk;.lN   Kc':::dKNKK      XKd.lN     Kxllcc::l0
;;                Nc'O    k,':clkX           Xc'k   Xo,:dkO0XN
;;                X;'0     X0kxo,,ck          K:,okd;;xN
;;                 d';lllllllloo;';x           XxlccxX
#+end_text

#+NAME: cromulon
#+begin_text
;;         ___
;;     . -^   `--,
;;    /# =========`-_
;;   /# (--====___====\
;;  /#   .- --.  . --.|
;; /##   |  * ) (   * ),
;; |##   \    /\ \    /|
;; |###   ---   \ ---  |
;; |####      ___)    #|
;; |######           ##|
;;  \##### ---------- /
;;   \####           (
;;    `\###          |
;;      \###         |
;;       \##        |
;;        \###.    .)
;;         `======/
#+end_text



#+NAME: msg
#+begin_text
look out,kittnm, daddys beerdrunk and sloshing about in emacs again
#+end_text


#+NAME: lambda-char
#+begin_text
;; λ
#+end_text

#+begin_src emacs-lisp :var shrek=shrek ankylosaur=ankylosaur plesiosaur=plesiosaur corythosaur=corythosaur stegosaurus=stegosaurus coffee=coffee gaetan-juvin=gaetan-juvin pale-blue-dot=pale-blue-dot dragon=dragon pooh-bear=pooh-bear tux=tux bulbasaur=bulbasaur earth=earth dudeism=dudeism grateful-dead=grateful-dead dancing-bear=dancing-bear lambda-char=lambda-char cromulon=cromulon squirtle=squirtle charmander=charmander keanu-breathtaking=keanu-breathtaking msg=msg
  (require 'subr-x)
  (let* ((l (list
             shrek keanu-breathtaking cromulon
             ankylosaur plesiosaur corythosaur stegosaurus
             coffee pale-blue-dot earth
             gaetan-juvin pooh-bear tux dragon
             bulbasaur squirtle charmander msg
             dudeism grateful-dead dancing-bear lambda-char))
         (msg (nth (random (length l)) l)))
    (setq initial-scratch-message
          (string-join (list ";; " (user-full-name) " -- " (current-time-string) "\n" msg))))
    ;; (setq initial-scratch-message (replace-regexp-in-string "^\\(.\\)" ";; \\1" (nth (random (length l)) l))))
    ;; (replace-regexp-in-string "^" ";; " s)
    ;; (setq initial-scratch-message (car (reverse l))))
#+end_src

#+RESULTS:
#+begin_example
;; misterbuttstuff -- Tue Mar 19 20:26:42 2024
        ___
    . -^   `--,
   /# =========`-_
  /# (--====___====\
 /#   .- --.  . --.|
/##   |  * ) (   * ),
|##   \    /\ \    /|
|###   ---   \ ---  |
|####      ___)    #|
|######           ##|
 \##### ---------- /
  \####           (
   `\###          |
     \###         |
      \##        |
       \###.    .)
        `======/
#+end_example
